# পাইথন কোড ব্যাখ্যা করার জন্য কমেন্ট ব্যবহার করা যেতে পারে। 
# কোডকে আরও সহজে পাঠযোগ্য করার জন্য কমেন্ট ব্যবহার করা যেতে পারে। 
# কোড পরীক্ষা করার সময় এক্সিকিউশন বন্ধ করার জন্য কমেন্ট ব্যবহার করা যেতে পারে।

# কমেন্ট # দিয়ে শুরু হলে, পাইথন সেগুলো উপেক্ষা করবে।
#This is a comment
print("Hello, World!")

# লাইনের শেষে কমেন্ট যোগ করা যায় এবং পাইথন লাইনের বাকি অংশ উপেক্ষা করে।
print("Hello, World!") #This is a comment

# কমেন্ট মানেই যে কোডের ব্যাখ্যা দেওয়া টেক্সট হতে হবে, 
# এমন নয়; এটি পাইথনকে কোড এক্সিকিউট করা থেকে বিরত রাখতেও ব্যবহার করা যেতে পারে।
#print("Hello, World!")
print("Cheers, Mate!")


# পাইথনে মাল্টিলাইন কমেন্টের জন্য নির্দিষ্ট কোনো সিনট্যাক্স নেই। 
# মাল্টিলাইন কমেন্ট যোগ করতে আপনি প্রতিটি লাইনের জন্য একটি # চিহ্ন ব্যবহার করতে পারেন।
#This is a comment
#written in
#more than just one line
print("Hello, World!")

# আপনি একটি মাল্টিলাইন স্ট্রিং ব্যবহার করতে পারেন। যেহেতু পাইথন সেইসব স্ট্রিং লিটারেল উপেক্ষা করে যেগুলো কোনো ভেরিয়েবলে অ্যাসাইন করা হয়নি, 
# তাই আপনি আপনার কোডে একটি মাল্টিলাইন স্ট্রিং (ট্রিপল কোট) যোগ করতে পারেন এবং এর ভেতরে আপনার কমেন্ট রাখতে পারেন।
"""
This is a comment
written in
more than just one line
"""
print("Hello, World!")