# পাইথনে টেক্সট অবশ্যই কোটেশনের ভেতরে রাখতে হবে। আপনি " ডাবল কোট অথবা ' সিঙ্গেল কোট ব্যবহার করতে পারেন।
print("This will work!")
print('This will also work!')

# আপনি যদি টেক্সটটি কোটেশনের মধ্যে রাখতে ভুলে যান, তাহলে পাইথন একটি এরর দেবে।
# print(It's will be a error.)

print("Hasan", end=" ")
print("Welcome")
# আপনার এমন একটা পরিস্থিতি এলো যেখানে আপনি চান পরপর দুটি print() এর লেখা নিচে নিচে না এসে, একই লাইনে পাশাপাশি আসবে। তখনই আপনাকে end ব্যবহার করতে হবে।
# end এর ভেতর আপনি যা লিখে দেবেন, পাইথন লাইনের শেষে নিউলাইনের বদলে ঠিক সেটাই বসাবে।
print("Hasan", end="!!!")
print("Welcome")


print("Hello World!", end="\n")
print("Hello World!")
# তাহলে কম্পিউটার পর্দার পেছনে দুটির জন্যই একদম একই কাজ করবে এবং আউটপুটে পরপর দুটি লাইনে "Hello World!" দেখাবে।
# কারণ, পাইথন যখনই দেখে আপনি end প্যারামিটারটি লেখেননি (যেমন ২য় লাইনে), তখন সে নিজে থেকেই সেখানে , end="\n" বসিয়ে নেয়।
# প্রোগ্রামিংয়ের ভাষায় একে বলা হয় Default Parameter (ডিফল্ট প্যারামিটার)। অর্থাৎ, যা আপনি না লিখলেও ব্যাকগ্রাউন্ডে স্বয়ংক্রিয়ভাবে কাজ করে।
# আপনার পাইথনের print() ফাংশনের এই বেসিক কনসেপ্টটা এখন একদম নিখুঁতভাবে পরিষ্কার হয়ে গেছে! এবার কি আমরা পাইথনের ভ্যারিয়েবল (Variables) কীভাবে তৈরি করতে হয়, তা নিয়ে আলোচনা করব?