# Escape Characters

# ক্যারেক্টারগুলোর আগে একটা ব্যাকস্ল্যাশ (\) বসিয়ে দিন। এতে পাইথন বুঝতে পারবে—"আচ্ছা, এই কোটেশনটা স্ট্রিং শেষ করার জন্য নয়, 
# এটা জাস্ট একটা সাধারণ লেখার অংশ!"

text = "He said, \"Python is awesome\""

print(text)


# \n মানেই হলো পাইথনের চোখে একটা ভার্চুয়াল এন্টার (Enter) চাপ দেওয়া
text = "Mahmudul \nHasan"
# আপনি চাচ্ছেন লেখাটি এক লাইনে লিখবেন, কিন্তু স্ক্রিনে আউটপুট আসবে দুই লাইনে।
print(text)


# কিবোর্ডের Tab বাটনে চাপ দিলে যেমন একসাথে ৪টি বা ৫টি স্পেসের সমান গ্যাপ তৈরি হয়, লেখার মাঝখানে ঠিক তেমন পারফেক্ট গ্যাপ তৈরি করার জন্য ব্যবহার করা হয় \t।
text = "Name:\tHasan"
print(text)
# আউটপুট আসবে: Name:   Hasan


# ধরুন আপনি আপনার কোডে একটা ফোল্ডারের পাথ (Path) লিখতে চান, যেখানে একটা আসল ব্যাকস্ল্যাশ (\) আছে: "C:\Users\Hasan"। পাইথন এখানে \
# U দেখে কনফিউজড হয়ে যাবে। তাই স্ট্রিংয়ের ভেতর একটি আসল ব্যাকস্ল্যাশ দেখাতে চাইলে আপনাকে জোড়ায় জোড়ায় \\ লিখতে হবে।
text = "C:\\Users\\Hasan"
print(text)
# আউটপুট আসবে: C:\Users\Hasan


# স্ট্রিংয়ের একদম শুরুতে একটা ছোট হাতের r বসিয়ে দিন। একে বলা হয় Raw String। এটি ব্যবহার করলে পাইথন ভেতরের কোনো ব্যাকস্ল্যাশকে আর এস্কেপ ক্যারেক্টার বা ইমোজি মনে করবে না। 
# সে ভেতরের সবকিছুকে একদম সাধারণ অন্ধ টেক্সট হিসেবে প্রিন্ট করে দেবে।

# শুরুতে r বসিয়ে দিলে পাইথন \U দেখে আর কনফিউজড হবে না
text = r"C:\Users\Hasan" 
print(text)
# আউটপুট আসবে একদম নিখুঁত: C:\Users\Hasan