# Format  String

age = 35 
name = "Hasan"
role = "Developer"

txt = "My name is {}, I am {} and my role was {}".format(name,age,role)
txt1 = f"My name is {name}, I am {age} and my role was {role}"

print(txt)
print(txt1)

# আজকালকার পাইথন ডেভলপাররা লেখার সুবিধার জন্য f-string বেশি ব্যবহার করলেও, ব্যাকগ্রাউন্ডে কিন্তু দুটোই স্ট্রিং ফরম্যাটিংয়ের কাজ করে।


# Modifier

# প্লেসহোল্ডারের ভেতরে ভ্যারিয়েবলের মানটি বসানোর পাশাপাশি আপনি যদি তার চেহারা বা ফরম্যাট বদলে দিতে চান, তবে কোলন (:) চিহ্ন ব্যবহার করে Modifier যোগ করতে হয়। এর সিনট্যাক্স হলো: {ভ্যারিয়েবল : মডিফায়ার}।

price = 450.12345
# ধরুন আপনার কাছে একটা বড় দশমিক সংখ্যা আছে 3.14159, কিন্তু আপনি আউটপুটে দশমিকের পর মাত্র ২ ঘর দেখাতে চান। তখন আপনি :.2f মডিফায়ার ব্যবহার করবেন (এখানে f মানে float, আর .2 মানে ২ ঘর)।

# :.2f হলো Modifier যা শুধু ২ ঘর রাখবে
text = f"The price is {price:.2f} TK"
print(text) 
# আউটপুট আসবে: The price is 450.12 TK


money = 1000000  # ১০ লাখ
# বড় বড় সংখ্যার ক্ষেত্রে (যেমন ব্যাংকের ব্যালেন্স বা টাকা) সহজে পড়ার জন্য মাঝখানে কমা বসানো দরকার হয়। এর জন্য মডিফায়ার হলো জাস্ট একটি কমা বা : এর পর ,।

# :, হলো Modifier যা আন্তর্জাতিক নিয়মে কমা বসিয়ে দেবে
text = f"My balance: {money:,} TK"
print(text)
# আউটপুট আসবে: My balance: 1,000,000 TK


points = 0.85
# কোনো দশমিক সংখ্যাকে (যেমন 0.75) সরাসরি শতকরা বা পার্সেন্টেজে রূপান্তর করে শেষে % চিহ্ন বসানোর জন্য এই মডিফায়ার ব্যবহার করা হয়।

# :.0% মানে দশমিকের পর ০ ঘর রেখে পার্সেন্টেজ বানাও
text = f"Your score is {points:.0%}"
print(text)
# আউটপুট আসবে: Your score is 85%


# { price  :  .2f }
#    ↑        ↑
# Placeholder | Modifier