# Method List




# ১. উপাদান যোগ করার মেথড (Adding Elements)
# লিস্টের ভেতরে নতুন কোনো ডেটা বা উপাদান ঢোকাতে এই ৩টি মেথড ব্যবহার করা হয়:


# append(): লিস্টের একবারে শেষে একটি নির্দিষ্ট উপাদান যোগ করে।
nums_1 = [1, 2]
nums_1.append(3)  # [1, 2, 3]


# insert(): লিস্টের যেকোনো নির্দিষ্ট ইনডেক্স বা পজিশনে উপাদান জোর করে ঢুকিয়ে দেয়। এর স্ট্রাকচার: insert(index, element)।
nums_2 = [1, 3]
nums_2.insert(1, 2)  # ১ নম্বর ইনডেক্সে ২ ঢুকবে -> [1, 2, 3]


# extend(): একটি লিস্টের পেছনে আরেকটি পুরো লিস্ট বা কালেকশনকে জোড়া দিয়ে লিস্টের সাইজ বড় করে।
nums_3 = [1, 2]
nums_3.extend([3, 4])  # [1, 2, 3, 4]




# ২. উপাদান মুছে ফেলার মেথড (Removing Elements)
# লিস্ট থেকে কোনো ডেটা বের করা বা ডিলিট করার জন্য এই ৪টি মেথড আছে:


# remove(): লিস্ট থেকে নির্দিষ্ট কোনো উপাদান ধরে মুছে ফেলে (ইনডেক্স নম্বর দিয়ে নয়)। একই জিনিস একাধিকবার থাকলে প্রথমটিকে ডিলিট করে।
fruits_4 = ["apple", "mango", "apple"]
fruits_4.remove("apple")  # ['mango', 'apple']


# pop(): নির্দিষ্ট ইনডেক্সের উপাদানটিকে লিস্ট থেকে টেনে বের করে (Remove করে এবং সেটি রিটার্ন করে)। ব্র্যাকেট খালি রাখলে সে ডিফল্টভাবে একদম শেষের উপাদানটি বের করে আনে।
nums_5 = [10, 20, 30]
last_item_5 = nums_5.pop()  # last_item হবে 30, আর nums হবে [10, 20]


# clear(): লিস্টের ভেতরের সব উপাদান এক ঝটকায় ডিলিট করে দিয়ে লিস্টটিকে পুরোপুরি খালি (Empty List) বানিয়ে ফেলে।
nums_6 = [1, 2, 3]
nums_6.clear()  # []



# ৩. খোঁজাখুঁজি ও গণনার মেথড (Searching & Counting)
# লিস্টের ভেতর কোনো তথ্য অনুসন্ধান করার জন্য এই ২টি মেথড ব্যবহার করা হয়:


# index(): কোনো উপাদান প্রথম কোন ইনডেক্স বা পজিশনে আছে, তার নম্বরটি খুঁজে বের করে দেয় (উপাদানটি না থাকলে এরর দেয়)।
nums = [10, 20, 30]
print(nums.index(20))  # আউটপুট: 1


# count(): একটি নির্দিষ্ট উপাদান পুরো লিস্টের ভেতরে মোট কতবার আছে, সেই সংখ্যাটি গুনে বের করে দেয়।
nums = [1, 2, 2, 3, 2]
print(nums.count(2))  # আউটপুট: 3


# ৪. সাজানো ও ওলটপালট করার মেথড (Ordering & Copying)
# লিস্টের ভেতরের ডেটার পজিশন বা মেমোরি হ্যান্ডেল করার জন্য বাকি ৩টি মেথড ব্যবহৃত হয়:


# sort(): লিস্টের উপাদানগুলোকে ক্রমানুসারে (ছোট থেকে বড় বা A to Z) সাজিয়ে দেয়। এর ভেতরে reverse=True বা কাস্টম key ব্যবহার করা যায়।
nums = [3, 1, 2]
nums.sort()  # [1, 2, 3]


# reverse(): লিস্টের উপাদানগুলো যেভাবে আছে, স্রেফ তাকে পেছন থেকে সামনে (উল্টো করে) সাজিয়ে দেয় (কোনো ছোট-বড় তুলনা ছাড়াই)।
nums = [1, 3, 2]
nums.reverse()  # [2, 3, 1]


# copy(): লিস্টের একটি সম্পূর্ণ স্বাধীন নতুন মেমোরি অবজেক্ট বা কপি (Shallow Copy) তৈরি করে দেয়।
nums = [1, 2]
new_nums = nums.copy()  # new_nums এবং nums আলাদা মেমোরি অবজেক্ট