# Variables

# পাইথনে ভেরিয়েবল ডিক্লেয়ার করার জন্য কোনো কমান্ড নেই। 
# যখনই আপনি প্রথমবার কোনো ভেরিয়েবলে মান অ্যাসাইন করেন, তখনই সেটি তৈরি হয়ে যায়।
x = 5
y = "mudra000"

print(x)
print(y)
print(x,y)

x2 = 4       # x2 is of type int
x2 = "Sally" # x2 is now of type str
print(x2)
# এখানে শুধু স্ট্রিংটি ("Sally") প্রিন্ট হওয়ার কারণ হলো: পাইথনে কোড সবসময় উপর থেকে নিচের দিকে ধাপে ধাপে চলে (Top-to-Bottom Execution), 
# এবং একই ভ্যারিয়েবলে নতুন কিছু রাখলে আগের মানটি মুছে যায়।
# ১. লাইন ১-এ যখন x = 4 ছিল, তখন কম্পিউটারের মেমরিতে x এর মান ৪-ই ছিল।
# ২. কিন্তু লাইন ২-এ এসে যখন আপনি আবার x = "Sally" লিখলেন, তখন পাইথন আগের মান (৪) কেটে কুটে একদম মুছে ফেলে তার জায়গায় নতুন মান "Sally" বসিয়ে দিয়েছে। এটাকে প্রোগ্রামিংয়ের ভাষায় বলা হয় Re-assignment (পুনরায় মান নির্ধারণ) বা ওভাররাইট (Overwrite) করা।
# ৩. যেহেতু পাইথন একদম লেটেস্ট বা সর্বশেষ মানটি মনে রাখে, তাই লাইন ৩-এ যখন আপনি print(x) দিয়েছেন, সে তখন বাক্সের ভেতরে থাকা একদম টাটকা মান "Sally"-কেই খুঁজে পেয়েছে এবং স্ক্রিনে দেখিয়েছে। ৪ নম্বরটি ততক্ষণে হাওয়া হয়ে গেছে!

x3 = "Sally" # x3 is now of type str
x3 = 4       # x3 is of type int
print(x3)

# জাভাস্ক্রিপ্টে const দিয়ে এমন ভ্যারিয়েবল বানানো হয় যেটার মান কখনো পরিবর্তন করা যায় না। কিন্তু পাইথনে এমন কোনো অফিশিয়াল কমান্ড নেই যা ভ্যারিয়েবলের মান পরিবর্তন করা আটকে দেবে।
# তবে পাইথনের একটি বেস্ট প্র্যাকটিস বা নিয়ম আছে। আপনি যদি চান কোনো ভ্যারিয়েবলের মান যেন কেউ পরিবর্তন না করে (অর্থাৎ সেটিকে const হিসেবে ব্যবহার করতে চান), তবে সেই ভ্যারিয়েবলের নামটি সব বড় হাতের অক্ষরে (UPPERCASE) লিখতে হয়।
PI = 3.14
GRAVITY = 9.8
# মনে রাখবেন: বড় হাতের অক্ষরে লিখলেও পাইথন কিন্তু আপনাকে জোর করে আটকাবে না (চাইলে পরে মান বদলানো যায়)। 
# তবে বড় হাতের অক্ষর দেখলে অন্য সব প্রোগ্রামাররা বুঝে নেয় যে—"খবরদার, এই ভ্যারিয়েবলের মান পরিবর্তন করা নিষেধ!"

# Casting

# পাইথনে Casting (কাস্টিং) বা Type Casting হলো এক ধরণের ডেটা টাইপকে অন্য ডেটা টাইপে জোরপূর্বক পরিবর্তন করা (Convert করা)।
x4 = str(3)    # x4 will be '3'
y4 = int(3)    # y4 will be 3
z4 = float(3)  # z4 will be 3.0
#  int() — যেকোনো উপযুক্ত ডেটাকে ইন্টিজার (পূর্ণসংখ্যা) বানানোর জন্য।
#  float() — যেকোনো উপযুক্ত ডেটাকে ফ্লোট (দশমিক সংখ্যা) বানানোর জন্য।
#  str() — যেকোনো ডেটাকে স্ট্রিং (টেক্সট) বানানোর জন্য।

# type() ফাংশন ব্যবহার করে কোনো ভেরিয়েবলের ডেটা টাইপ জানা যায়।
x5 = 5
y5 = "John"
print(type(x5))
print(type(y5))

# Variable names are case-sensitive.
a = 4
A = "mudra000" # A will not overwrite  a

# স্ট্রিং ভেরিয়েবল সিঙ্গেল বা ডাবল কোট ব্যবহার করে ঘোষণা করা যায়।
x = "mudra000"
# is the same as 
x = 'mudra000'
