import os 


current_path = os.path.dirname(__file__)
file_path = os.path.join(current_path,"_1_demofile.txt")

# PYthon Read Files

# f = open(file_path,"r")
# print(f.read())
# স্মার্ট হ্যান্ডলিং: পাইথন যখনই দেখে আপনি with ব্লকের ভেতরের কোডটুকু (যেমন print(f.read())) রান করে ফেলেছেন এবং তার লাইনের সীমানা থেকে বের হয়ে গেছেন, সে ম্যাজিকের মতো নিজে থেকেই ফাইলটি বন্ধ (close) করে দেয়।
# রিসোর্স রিলিজ: মেমোরি থেকে ফাইলের ডেটা সাথে সাথে খালি হয়ে যায় এবং অপারেটিং সিস্টেমের চাবিটা ফিরিয়ে দেওয়া হয়।
# এরর প্রতিরোধী (Error Proof): ধরুন, ফাইল থেকে ডেটা রিড করার সময় মাঝপথে কোনো একটা এরর (Error) আসলো এবং কোড ক্র্যাশ করল। with ছাড়া কোড লিখলে ক্র্যাশ করার কারণে নিচের f.close() লাইনটি রানই হতে পারত না, 
# ফলে ফাইলটা আজীবনের জন্য লক হয়ে থাকত। কিন্তু with ব্যবহার করলে কোড ক্র্যাশ করলেও পাইথন ব্যাকঅ্যান্ডে ফাইলটা ঠিকই লক ছেড়ে বন্ধ করে দেয়!

with open(file_path,"r") as file:
    print(file.read())
# এই লাইনে আসার সাথে সাথে ফাইল অটোমেটিক ক্লোজড!


# সহজ কথায়, with ছাড়া কোড লেখা মানে হলো রুম থেকে বের হওয়ার সময় লাইট-ফ্যান বন্ধ করার দায়িত্ব নিজের ঘাড়ে রাখা (যা আমরা মানুষরা প্রায়ই ভুলে যাই)। 
# আর with দিয়ে কোড লেখা মানে রুমে একটি অটোমেটিক মোশন সেন্সর লাইট লাগানো—আপনি বের হওয়া মাত্রই লাইট-ফ্যান নিজে নিজে বন্ধ হয়ে যাবে!


# Read Only Parts of the File
# By default the read() method returns the whole text, but you can also specify how many characters you want to return:

# Return the 5 first characters of the file:

# with open("demofile.txt") as f:
#   print(f.read(5))


# readline()

# আমরা একটু আগে যে .read() ফাংশনটি দেখেছিলাম, সে এক টানে ফাইলের ভেতরের সব লেখা একসাথে পড়ে নিয়ে আসত (যেন পুরো বইটা এক পলকে পড়ে ফেলা)। কিন্তু .readline() কাজ করে একদম ভিন্নভাবে।
# সহজ কথায়: .readline() ফাংশনটি একটি ফাইলের ভেতর থেকে পুরোটা একসাথে না পড়ে, শুধুমাত্র একটি লাইনের (Single Line) টেক্সট পড়ে নিয়ে আসে। আপনি যতবার এই ফাংশনটিকে ডাকবেন, সে ফাইলটির ওপর থেকে এক এক করে ঠিক তার পরের লাইনটি রিড করবে।